#include<iostream>
using namespace std;


int main() {
	//指针与数组
	//利用指针访问数组中的元素
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };

	int* p = arr;//因为arr是个数组名  而数组名就是数组的首地址

	cout<<"利用指针访问数组第一个元素" << *p << endl;

	p++;//因为你定义的是整型指针 所以p加一次 往后偏移的是四个字节 这样就可以让指针指到第二位了

	cout<<"利用指针访问数组第二个元素" << *p << endl;

	cout << "----------------------------------------------------------------------" << endl;

	int* p2 = arr;

	for (int i = 0;i < 10;i++) {
		cout<<"利用指针遍历整个数组" << *p2 << endl;
		p2++;


	}





	system("pause");
	return 0;
}
